"use strict"
///////////////////////////// Задача 1 //////////////////////////////////////////////
let name = prompt("Введите ваше имя");
alert("Привет " + name);
///////////////////////////// Задача 2 //////////////////////////////////////////////
let bithyear = prompt("Введите ваш год рождения");
let date = new Date();
const currentyear = date.getFullYear();
console.log(currentyear);
alert("Вам "+ (currentyear - bithyear) + " лет");
///////////////////////////// Задача 3 //////////////////////////////////////////////
let side = prompt("Введите сторону квадрата");
alert("Периметр данного квадрата: " + (side*4));
///////////////////////////// Задача 4 //////////////////////////////////////////////
let radius = prompt("Введите радиус окружности");
let So = (2 * Math.PI * radius * radius).toFixed(2);
alert("Периметр данной окружности: " + So);
///////////////////////////// Задача 5 //////////////////////////////////////////////
let S = prompt("Введите расстояние от одного города до другого в км");
let t = prompt("Введите время(в часах) за которое вы хотитите добраться в другой город");
alert("Необходимая скорость: " + (Math.round((S/t)) + " км\\ч"));
///////////////////////////// Задача 6 //////////////////////////////////////////////
let usd = prompt("Введите сумму в доларах");
const curs = 0.91;
alert("USD: " + usd + "\n" + "EUR: " + (usd * curs));
///////////////////////////// Задача 7 //////////////////////////////////////////////
let gb = prompt("Введите объём флешки в Гб");
let count = Math.floor(( gb * 1024 ) / 820);
alert("Допустимое количество файло по 820 мб: " + count + "\nНа флешке останется: " + (gb*1024 - count * 820) + "мб");
///////////////////////////// Задача 8 //////////////////////////////////////////////
let somme = prompt("Введите сумма денег в кошельке");
let price = prompt("Введите цену одной шоколадки");
let c = Math.floor(somme/price);
alert("Количество шоколадок: " + c + "\nВ кошельке останется: " + (somme - c * price));
///////////////////////////// Задача 9 //////////////////////////////////////////////
let number = prompt("Введите трёхзначное число");
let hundreds = parseInt(number / 100);
number = number % 100;
let decades = parseInt(number / 10);
number = number % 10;
alert("Конечный результат: " + number + decades + hundreds);
///////////////////////////// Задача 10 //////////////////////////////////////////////
let ch = parseInt(prompt("Введите целое число"));
let result;
ch % 2 == 0 ? result = "Четное" : result = "Нечетное";
alert(result);
